nxp-appcodehub/dm-low-power-wireless-sensors-examples-for-mcxw23/sensors_examples_for_mcxw23/frmdmcxw23_mpl3115_pressure_wakeup_ble/examples/_boards/frdmmcxw23/wireless_examples/pin_mux.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

 #ifndef _PIN_MUX_H_
 #define _PIN_MUX_H_
 
 /*!
  * @addtogroup pin_mux
  * @{
  */
 
 /***********************************************************************************************************************
  * API
  **********************************************************************************************************************/
 
 #if defined(__cplusplus)
 extern "C" {
 #endif
 
 /*!
  * @brief Calls initialization functions.
  *
  */
 void BOARD_InitBootPins(void);
 
 #define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
 #define IOCON_PIO_FUNC0 0x00u         /*!<@brief Selects pin function 0 */
 #define IOCON_PIO_FUNC1 0x01u         /*!<@brief Selects pin function 1 */
 #define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
 #define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
 #define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
 #define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */
 
 /*! @name PIO0_19 (number 7), LED_BLUE
   @{ */
 
 /* Symbols to be used with GPIO driver */
 #define BOARD_INITPINS_LED_BLUE_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
 #define BOARD_INITPINS_LED_BLUE_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */
 #define BOARD_INITPINS_LED_BLUE_PORT 0U                   /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITPINS_LED_BLUE_PIN 19U                   /*!<@brief PORT pin number */
 #define BOARD_INITPINS_LED_BLUE_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                           /* @} */
 
 /*! @name PIO0_1 (number 1), RGB_RED
   @{ */
 
 /* Symbols to be used with GPIO driver */
 #define BOARD_INITPINS_RGB_RED_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
 #define BOARD_INITPINS_RGB_RED_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */
 #define BOARD_INITPINS_RGB_RED_PORT 0U                  /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITPINS_RGB_RED_PIN 1U                   /*!<@brief PORT pin number */
 #define BOARD_INITPINS_RGB_RED_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                         /* @} */
 
 /*! @name PIO0_0 (number 31), RGB_GREEN
   @{ */
 
 /* Symbols to be used with GPIO driver */
 #define BOARD_INITPINS_RGB_GREEN_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
 #define BOARD_INITPINS_RGB_GREEN_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */
 #define BOARD_INITPINS_RGB_GREEN_PORT 0U                  /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITPINS_RGB_GREEN_PIN 0U                   /*!<@brief PORT pin number */
 #define BOARD_INITPINS_RGB_GREEN_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                           /* @} */
 
 /*! @name PIO0_4 (number 4), RGB_BLUE
   @{ */
 
 /* Symbols to be used with GPIO driver */
 #define BOARD_INITPINS_RGB_BLUE_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
 #define BOARD_INITPINS_RGB_BLUE_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */
 #define BOARD_INITPINS_RGB_BLUE_PORT 0U                  /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITPINS_RGB_BLUE_PIN 4U                   /*!<@brief PORT pin number */
 #define BOARD_INITPINS_RGB_BLUE_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                          /* @} */
 
 /*! @name PIO0_18 (number 8), BUTTON0
   @{ */
 
 /* Symbols to be used with GPIO driver */
 #define BOARD_INITPINS_BUTTON0_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
 #define BOARD_INITPINS_BUTTON0_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */
 #define BOARD_INITPINS_BUTTON0_PORT 0U                   /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITPINS_BUTTON0_PIN 18U                   /*!<@brief PORT pin number */
 #define BOARD_INITPINS_BUTTON0_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                          /* @} */
														  
/*! @name PIO0_15 (number 35), ACCL_INT1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITACCELPINS_ACCL_INT1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITACCELPINS_ACCL_INT1_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */
#define BOARD_INITACCELPINS_ACCL_INT1_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_ACCL_INT1_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITACCELPINS_ACCL_INT1_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                                /* @} */
																
/*! @name PIO0_16 (number 32), INT2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITACCELPINS_ACCL_INT2_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITACCELPINS_ACCL_INT2_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */
#define BOARD_INITACCELPINS_ACCL_INT2_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_ACCL_INT2_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITACCELPINS_ACCL_INT2_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                                /* @} */
 
 /*! @name PIO0_21 (number 14), BUTTON1
   @{ */
 
 /* Symbols to be used with GPIO driver */
 #define BOARD_INITPINS_BUTTON1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
 #define BOARD_INITPINS_BUTTON1_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */
 #define BOARD_INITPINS_BUTTON1_PORT 0U                   /*!<@brief PORT peripheral base pointer */
 #define BOARD_INITPINS_BUTTON1_PIN 21U                   /*!<@brief PORT pin number */
 #define BOARD_INITPINS_BUTTON1_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                          /* @} */
 
 /*!
  * @brief Configures pin routing and optionally pin electrical features.
  *
  */
 void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */
 
 /*!
 * @brief Enables digital function */
#define IOCON_PIO_DIGITAL_EN 0x0100u
/*!
 * @brief IO is an open drain cell */
#define IOCON_PIO_ECS_DI 0x00u
/*!
 * @brief GPIO mode */
#define IOCON_PIO_EGP_GPIO 0x4000u
/*!
 * @brief Selects pin function 1 */
#define IOCON_PIO_FUNC1 0x01u
/*!
 * @brief I2C 50 ns glitch filter enabled. Typically used for Standard mode, Fast-mode and Fast-mode Plus I2C. */
#define IOCON_PIO_I2CFILTER_NONHIGHSPEED 0x00u
/*!
 * @brief Input filter disabled */
#define IOCON_PIO_INPFILT_OFF 0x1000u
/*!
 * @brief Input function is not inverted */
#define IOCON_PIO_INV_DI 0x00u
/*!
 * @brief No addition pin function */
#define IOCON_PIO_MODE_INACT 0x00u
/*!
 * @brief Open drain is disabled */
#define IOCON_PIO_OPENDRAIN_DI 0x00u
/*!
 * @brief Standard mode, output slew rate control is enabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u
/*!
 * @brief 3V3 signaling in I2C mode */
#define IOCON_PIO_SSEL_3V3 0x00u

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void I2C1_InitPins(void); /* Function assigned for the Cortex-M33 */

/*!
 * @brief Enables digital function */
#define IOCON_PIO_DIGITAL_EN 0x0100u
/*!
 * @brief IO is an open drain cell */
#define IOCON_PIO_ECS_DI 0x00u
/*!
 * @brief GPIO mode */
#define IOCON_PIO_EGP_GPIO 0x4000u
/*!
 * @brief Selects pin function 0 */
#define IOCON_PIO_FUNC0 0x00u
/*!
 * @brief I2C 50 ns glitch filter enabled. Typically used for Standard mode, Fast-mode and Fast-mode Plus I2C. */
#define IOCON_PIO_I2CFILTER_NONHIGHSPEED 0x00u
/*!
 * @brief Input filter disabled */
#define IOCON_PIO_INPFILT_OFF 0x1000u
/*!
 * @brief Input function is not inverted */
#define IOCON_PIO_INV_DI 0x00u
/*!
 * @brief No addition pin function */
#define IOCON_PIO_MODE_INACT 0x00u
/*!
 * @brief Open drain is disabled */
#define IOCON_PIO_OPENDRAIN_DI 0x00u
/*!
 * @brief Standard mode, output slew rate control is enabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u
/*!
 * @brief 3V3 signaling in I2C mode */
#define IOCON_PIO_SSEL_3V3 0x00u

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void I2C1_DeinitPins(void); /* Function assigned for the Cortex-M33 */

/*!
 * @brief Enables digital function */
#define IOCON_PIO_DIGITAL_EN 0x0100u
/*!
 * @brief IO is an open drain cell */
#define IOCON_PIO_ECS_DI 0x00u
/*!
 * @brief GPIO mode */
#define IOCON_PIO_EGP_GPIO 0x4000u
/*!
 * @brief Selects pin function 1 */
#define IOCON_PIO_FUNC1 0x01u
/*!
 * @brief Selects pin function 2 */
#define IOCON_PIO_FUNC2 0x02u
/*!
 * @brief I2C 50 ns glitch filter enabled. Typically used for Standard mode, Fast-mode and Fast-mode Plus I2C. */
#define IOCON_PIO_I2CFILTER_NONHIGHSPEED 0x00u
/*!
 * @brief Input filter disabled */
#define IOCON_PIO_INPFILT_OFF 0x1000u
/*!
 * @brief Input function is not inverted */
#define IOCON_PIO_INV_DI 0x00u
/*!
 * @brief No addition pin function */
#define IOCON_PIO_MODE_INACT 0x00u
/*!
 * @brief Open drain is disabled */
#define IOCON_PIO_OPENDRAIN_DI 0x00u
/*!
 * @brief Standard mode, output slew rate control is enabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u
/*!
 * @brief 3V3 signaling in I2C mode */
#define IOCON_PIO_SSEL_3V3 0x00u

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI1_InitPins(void); /* Function assigned for the Cortex-M33 */

/*!
 * @brief Enables digital function */
#define IOCON_PIO_DIGITAL_EN 0x0100u
/*!
 * @brief IO is an open drain cell */
#define IOCON_PIO_ECS_DI 0x00u
/*!
 * @brief GPIO mode */
#define IOCON_PIO_EGP_GPIO 0x4000u
/*!
 * @brief Selects pin function 0 */
#define IOCON_PIO_FUNC0 0x00u
/*!
 * @brief I2C 50 ns glitch filter enabled. Typically used for Standard mode, Fast-mode and Fast-mode Plus I2C. */
#define IOCON_PIO_I2CFILTER_NONHIGHSPEED 0x00u
/*!
 * @brief Input filter disabled */
#define IOCON_PIO_INPFILT_OFF 0x1000u
/*!
 * @brief Input function is not inverted */
#define IOCON_PIO_INV_DI 0x00u
/*!
 * @brief No addition pin function */
#define IOCON_PIO_MODE_INACT 0x00u
/*!
 * @brief Open drain is disabled */
#define IOCON_PIO_OPENDRAIN_DI 0x00u
/*!
 * @brief Standard mode, output slew rate control is enabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u
/*!
 * @brief 3V3 signaling in I2C mode */
#define IOCON_PIO_SSEL_3V3 0x00u

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI1_DeinitPins(void); /* Function assigned for the Cortex-M33 */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void USART0_InitPins(void); /* Function assigned for the Cortex-M33 */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void USART0_DeinitPins(void); /* Function assigned for the Cortex-M33 */
 
 #if defined(__cplusplus)
 }
 #endif
 
 /*!
  * @}
  */
 #endif /* _PIN_MUX_H_ */
 
 /***********************************************************************************************************************
  * EOF
  **********************************************************************************************************************/
 